package com.pengxh.ncnn.yolov8

object LocaleConstant {
    val TARGET_NAMES_ARRAY = arrayListOf(
        "三脚架", "三通", "人", "切断阀", "危险告知牌",
        "压力测试仪", "压力表", "反光衣", "呼吸面罩", "喉箍",
        "圆头水枪", "安全告知牌", "安全帽", "安全标识", "安全绳",
        "对讲机", "尖头水枪", "开关", "报警装置", "接头",
        "施工路牌", "气体检测仪", "水带", "水带_矩形", "流量计",
        "消火栓箱", "灭火器", "照明设备", "熄火保护", "电线暴露",
        "电路图", "警戒线", "调压器", "调长器", "贴纸",
        "跨电线", "路锥", "软管", "过滤器", "配电箱",
        "长柄阀门", "阀门", "风管"
    )

    val SEGMENTATION_ARRAY = arrayOf("弯折", "断裂", "烧焦", "磨损", "铁锈", "龟裂")
}